Revit 2027 API
AreaBasedLoadData.PowerFactorState Property
 The power factor state of the area based load.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public PowerFactorStateType PowerFactorState { get; }
Public ReadOnly Property PowerFactorState As PowerFactorStateType
	Get
public:
property PowerFactorStateType PowerFactorState {
	PowerFactorStateType get ();
}
member PowerFactorState : PowerFactorStateType with get
Property Value
PowerFactorStateType
Remarks
 This property is used to retrieve the power factor state of the area based load.
See Also
Reference
AreaBasedLoadData Class
Autodesk.Revit.DB.Electrical Namespace